---
title: ImageTypeOptions
classe: Autodesk.Revit.DB.ImageTypeOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ImageTypeOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `imageTypeOptions.IsValidObject` | Boolean |
| `Int32 PageNumber { get; set; }` | `imageTypeOptions.PageNumber` | Int32 |
| `String Path { get; }` | `imageTypeOptions.Path` | String |
| `Double Resolution { get; set; }` | `imageTypeOptions.Resolution` | Double |
| `ImageTypeSource SourceType { get; set; }` | `imageTypeOptions.SourceType` | ImageTypeSource |
| `Void Dispose()` | `imageTypeOptions.Dispose()` | Void |
| `Boolean IsValid(Document)` | `imageTypeOptions.IsValid(document)` | Boolean |
| `Void SetExternalResourceReference(ExternalResourceReference)` | `imageTypeOptions.SetExternalResourceReference(resourceReference)` | Void |
| `Void SetPath(String, Boolean)` | `imageTypeOptions.SetPath(path, useRelativePath)` | Void |
| `Void SetPath(String)` | `imageTypeOptions.SetPath(path)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```